micropython/micropython/ports/esp32/boards/ESP32_GENERIC_C5/mpconfigboard.h
// This configuration is for a generic ESP32C5 board with 4MiB (or more) of flash.

#define MICROPY_HW_BOARD_NAME               "ESP32C5 module"
#define MICROPY_HW_MCU_NAME                 "ESP32C5"

#define MICROPY_PY_MACHINE_I2S              (0)
#define MICROPY_HW_ENABLE_UART_REPL         (1)
